数据结构/数据结构/Treap&Splay/20180309讲课Splay/list_sol.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>list<sup>solutions</sup></title>
<!-- 2018-03-09 五 15:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="SysCon" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
f
</head>
<body>
<div id="content">
<h1 class="title">list<sup>solutions</sup></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Options</a>
<ul>
<li><a href="#sec-1-1">1.1. rotate (x, k):</a></li>
<li><a href="#sec-1-2">1.2. splay(x, k):</a></li>
<li><a href="#sec-1-3">1.3. split(l, r):</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Problem 1</a></li>
<li><a href="#sec-3">3. Problem 2</a></li>
<li><a href="#sec-4">4. Problem 3</a></li>
<li><a href="#sec-5">5. Problem 4</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2018-03-09 五&gt;</span></span>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Options</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>首先说一说一个很重要的操作。</b>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> rotate (x, k):</h3>
<div class="outline-text-3" id="text-1-1">
<p>
将x往上翻转一下。 
</p>

<p>
首先假设x的父亲为y。
</p>

<p>
假设x的它父亲的a(a为l或r)儿子，那么将y父亲设为x的父亲，y的父亲设为x。
</p>

<p>
然后将x的a<sup>1</sup>(如果x是y的右儿子那么a<sup>1就是左儿子</sup>)儿子的父亲设为y同时将y的a儿子变成x的a<sup>1儿子。</sup>
</p>

<p>
最后将x的a<sup>1儿子变成y就行。</sup>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> splay(x, k):</h3>
<div class="outline-text-3" id="text-1-2">
<p>
将节点x旋转到点k并且不改变区间顺序并且保证每个节点维护的值是正确的。
</p>

<p>
一般来说Splay是将某个点旋转到根节点。‘
</p>

<p>
翻转规则:
</p>

<p>
如果x的父亲就是k，则直接将x和父亲翻转一下。
</p>

<p>
不然的话。。。
</p>

<p>
设y为x的父亲，z为y的父亲。
</p>

<p>
如果x, y, z三点共线，那么先旋转y, z，此时x的父亲变成了z，然后旋转x, z，使x在y， z的上面。
</p>

<p>
如果三点不共线，那么旋转两次x即可。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> split(l, r):</h3>
<div class="outline-text-3" id="text-1-3">
<p>
就是将原序列中区间[l,r]分离成splay中的一棵单独子树，如何做到请自己想一想。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problem 1</h2>
<div class="outline-text-2" id="text-2">
<p>
UVa11922
</p>

<p>
splay模板中的模板题
</p>

<p>
翻转就直接split那一段区间，然后每次操作到某一个节点之前先pushdown()更新下面的节点信息（其实就是将翻转标记推到下面一层的子树顶点）
</p>

<p>
最后输出就直接那啥那啥一下就行了。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Problem 2</h2>
<div class="outline-text-2" id="text-3">
<p>
BZOJ1208 宠物收养所
</p>

<p>
splay模板题
</p>

<p>
用一棵Splay维护当前待在宠物店中的生物，很显然，对于任意一个时间两种生物的数量不可能同时大于1。
</p>

<p>
每次输入某个点就判断和当前Splay标记是否相同，如果相同，说明和待在店中的生物是相同的，没有某一个生物可以离开，直接加入Splay。
</p>

<p>
如果不同，说明新进入的生物肯定会被店中的取走或者会取走店中的一个。
</p>

<p>
此时在Splay中查询当前新进生物的权值在Splay中的前驱和后继然后统计答案。
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Problem 3</h2>
<div class="outline-text-2" id="text-4">
<p>
BZOJ1500 维修数列 
</p>

<p>
splay模板题 
</p>

<p>
先将需要的区间[l, r]通过split(l, r - l +１)分离出来再进行操作。 
</p>

<p>
求最大子列和，使用lx[], rx[], 分别维护子树所在连续区间从最左边开始的和最大区间和从最右边开始的和最大区间。mx[]维护整棵子树最大子列和。
</p>

<p>
翻转直接在区间总顶点打个翻转标记表示整棵子树都应该翻转。
</p>

<p>
插入，split(pos<sub>i</sub>, pos<sub>i</sub> + 1)之后插入c<sub>1</sub>~c<sub>tot组成的一整棵子树。</sub>
</p>

<p>
删除，split(pos<sub>i</sub>, pos<sub>i</sub> +　tot) 然后直接删除分离出的一颗子树update它的父亲和爷爷。
</p>

<p>
求和，split(pos<sub>i</sub>, pos<sub>i</sub> + tot) 然后直接输出分离出的子树顶点所维护的整个子树的和。
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Problem 4</h2>
<div class="outline-text-2" id="text-5">
<p>
BZOJ1014 火星人prefix 
</p>

<p>
<b>Splay+二分答案+hash</b>
</p>

<p>
详细一点，就是因为每颗子树肯定是一段连续的区间，所以每个点可以维护其子树的hash值。
</p>

<p>
（其实就是一段子串的hash值），这样子就十分容易了。
</p>

<p>
修改操作：就按splay的修改就行，记得update；
</p>

<p>
插入操作：等同于split（[l, l + 1]）这个区间，然后加一个叶子节点更新父亲和爷爷。
</p>

<p>
查询操作：二分LCP的长度，设为mid,则将两个区间（[l<sub>1</sub>, l<sub>1</sub> + mid], [l<sub>2</sub>, l<sub>2</sub> + mid]）
</p>

<p>
分别split之后查询顶点维护的hash值。
</p>



<p>
<b>Emacs 25.3.1 (Org mode 8.2.10)</b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: SysCon</p>
<p class="date">Created: 2018-03-09 五 15:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
